htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
/*
 * Some constants, hardware definitions and comments taken from ST's HAL driver
 * library, COPYRIGHT(c) 2015 STMicroelectronics.
 */

/*
 * FreeRTOS+TCP V2.3.4
 * Copyright (C) 2021 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

/* Standard includes. */
#include <stdio.h>
#include <stdint.h>
#include <time.h>
#include <ctype.h>

/* FreeRTOS includes. */
#include <FreeRTOS.h>
#include "task.h"
#include "timers.h"
#include "queue.h"
#include "semphr.h"

/* FreeRTOS+TCP includes. */
#include "FreeRTOS_IP.h"
#include "FreeRTOS_Sockets.h"
#include "FreeRTOS_TCP_server.h"
#include "FreeRTOS_DHCP.h"
#include "tcp_mem_stats.h"
#include "NetworkBufferManagement.h"
#include "NetworkInterface.h"
#include "FreeRTOS_IP_Private.h"
#if( ipconfigMULTI_INTERFACE != 0 )
	#include "FreeRTOS_Routing.h"
	#include "FreeRTOS_ND.h"
#endif

#if( USE_PLUS_FAT != 0 )
	/* FreeRTOS+FAT includes. */
	#include "ff_headers.h"
	#include "ff_stdio.h"
	#include "ff_ramdisk.h"
	#include "ff_sddisk.h"
#endif

#define EXTERN_C  extern

#if USE_LOG_EVENT
	#include "eventLogging.h"
#endif

/* Demo application includes. */
#include "hr_gettime.h"

#include "UDPLoggingPrintf.h"

#if( USE_IPERF != 0 )
	#include "iperf_task.h"
#endif

#if ( USE_TELNET != 0 )
	#include "telnet.h"
	extern void xSetupTelnet();
#endif
//#define __STM32_HAL_LEGACY   1
#include "date_and_time.h"

#if( USE_PLUS_FAT != 0 )
	#include "stm32f7xx_hal.h"
	#include "stm32fxx_hal_eth.h"
#endif

#if( USE_TCP_DEMO_CLI != 0 )
	#include "plus_tcp_demo_cli.h"
#endif

#if( HAS_AUDIO != 0 )
	#include "playerRecorder.h"
#endif

/* SDRAM on STM32F746g discovery_sdram */
/* See Framework/mysource/stm32746g_discovery_sdram.c */
#define SDRAM_START  0xC0000000U
#define SDRAM_SIZE  ( 8U * 1024U * 1024U )

/* The following function is called before FreeRTOS has started.
 * It loops for a certain amount of msec. */
EXTERN_C void BM_Delay( uint32_t ulDelayMS );


//#if defined( MBEDTLS_PLATFORM_TIME_TYPE_MACRO )
//	#error 1
//#else
//	#error 2
//#endif
//
//#if defined( MBEDTLS_PLATFORM_TIME_ALT )
//	#error 3
//#else
//	#error 4
//#endif
//
//#if defined( MBEDTLS_PLATFORM_TIME_MACRO )
//	#error 5
//#else
//	#error 6
//#endif

#if( ipconfigMULTI_INTERFACE != 0 )
	void showEndPoint( NetworkEndPoint_t *pxEndPoint );
#else
	#ifndef ipSIZE_OF_IPv4_ADDRESS
		#define ipSIZE_OF_IPv4_ADDRESS		4
	#endif
	#define FREERTOS_AF_INET4			FREERTOS_AF_INET
#endif

#if( HAS_ECHO_TEST != 0 )
	/* The CLI command "plus" will start an echo server. */
	#include "plus_echo_server.h"
#endif

//#include "cmsis_os.h"
/* FTP and HTTP servers execute in the TCP server work task. */
#define mainTCP_SERVER_TASK_PRIORITY	( tskIDLE_PRIORITY + 3 )
#define	mainTCP_SERVER_STACK_SIZE		2048
#define	mainFAT_SERVER_STACK_SIZE		( 1024U )

/* Some macros related to +FAT testing. */
#define	mainFAT_TEST_STACK_SIZE			2048
#define mainRUN_STDIO_TESTS				0
#define mainHAS_RAMDISK					0
#define mainRAM_DISK_NAME               "/ram"
#define mainHAS_SDCARD					1
#define mainSD_CARD_DISK_NAME			"/"
#define mainSD_CARD_TESTING_DIRECTORY	"/fattest"

/* Remove this define if you don't want to include the +FAT test code. */
#define mainHAS_FAT_TEST				1

/* Set the following constants to 1 to include the relevant server, or 0 to
exclude the relevant server. */
#define mainCREATE_FTP_SERVER			1
#define mainCREATE_HTTP_SERVER 			1

/* The function ff_mkdir() may have a second parameter which allows
 * recursive creation of directories. */
#if( ffconfigMKDIR_RECURSIVE != 0 )
	#define MKDIR_RECURSE  , pdFALSE
#else
	#define MKDIR_RECURSE
#endif


/* Define names that will be used for DNS, LLMNR and NBNS searches. */
#define mainHOST_NAME					"stm"
#define mainDEVICE_NICK_NAME			"stm32f7"


#ifdef HAL_WWDG_MODULE_ENABLED
	#warning Why enable HAL_WWDG_MODULE_ENABLED
#endif

#if( ipconfigUSE_DNS_CACHE == 0 )
	#warning Please enable ipconfigUSE_DNS_CACHE
#endif

#ifndef GPIO_SPEED_LOW
    /* Not all versions of the HAL have these macros defines. */
	#define  GPIO_SPEED_LOW         ((uint32_t)0x00000000)  /*!< Low speed     */
	#define  GPIO_SPEED_MEDIUM      ((uint32_t)0x00000001)  /*!< Medium speed  */
	#define  GPIO_SPEED_FAST        ((uint32_t)0x00000002)  /*!< Fast speed    */
	#define  GPIO_SPEED_HIGH        ((uint32_t)0x00000003)  /*!< High speed    */
#endif

#define logPrintf  lUDPLoggingPrintf

/* Random Number Generator. */
static RNG_HandleTypeDef hrng;

int verboseLevel;

typedef enum {
	eIPv4 = 0x01,
	eIPv6 = 0x02,
} eIPVersion;

/* This variable is allowed for testing mDNS/LLMNR requests
 * in all combinations. */
eIPVersion allowIPVersion = ( eIPVersion ) ( ( uint8_t ) eIPv4 | ( uint8_t ) eIPv6 );

#if( USE_PLUS_FAT != 0 )
	FF_Disk_t *pxSDDisk;
	static FF_Disk_t *pxRAMDisk;
#endif

static TCPServer_t *pxTCPServer = NULL;

enum EStartupPhase {
    EStartupWait,
	EStartupStart,
	EStartupStarted
};

static volatile enum EStartupPhase xStartServices = EStartupWait;

#ifndef ARRAY_SIZE
#	define	ARRAY_SIZE( x )	( int )( sizeof( x ) / sizeof( x )[ 0 ] )
#endif

SemaphoreHandle_t xServerSemaphore;

