htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
/* Private function prototypes -----------------------------------------------*/

/*
 * Creates a RAM disk, then creates files on the RAM disk.  The files can then
 * be viewed via the FTP server and the command line interface.
 */
static void prvCreateDiskAndExampleFiles( void );

EXTERN_C void vStdioWithCWDTest( const char *pcMountPath );
EXTERN_C void vCreateAndVerifyExampleFiles( const char *pcMountPath );

#if( USE_PLUS_FAT != 0 )
	static void check_disk_presence(void);
#endif

/*
 * The task that runs the FTP and HTTP servers.
 */
static void prvServerWorkTask( void *pvParameters );
static BaseType_t vHandleOtherCommand( Socket_t xSocket, char *pcBuffer );

/*
 * Configure the hardware as necessary to run this demo.
 */
static void prvSetupHardware( void );

/*
 * Configure the system clock for maximum speed.
 */
static void prvSystemClockConfig( void );

static void heapInit( void );

void vShowTaskTable( BaseType_t aDoClear );
void vIPerfInstall( void );

void tcpServerStart();
void tcpServerWork();

uint32_t ulServerIPAddress;

/* Default MAC address configuration.  The demo creates a virtual network
connection that uses this MAC address by accessing the raw Ethernet data
to and from a real network connection on the host PC.  See the
configNETWORK_INTERFACE_TO_USE definition for information on how to configure
the real network connection to use. */
#if( ipconfigMULTI_INTERFACE == 0 )
	const uint8_t ucMACAddress[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };
#else
	static const uint8_t ucMACAddress1[ 6 ] = { configMAC_ADDR0, configMAC_ADDR1, configMAC_ADDR2, configMAC_ADDR3, configMAC_ADDR4, configMAC_ADDR5 };
#endif /* ipconfigMULTI_INTERFACE */

/* Handle of the task that runs the FTP and HTTP servers. */
static TaskHandle_t xServerWorkTaskHandle = NULL;
#if( USE_PLUS_FAT != 0 )
	static TaskHandle_t xFTPWorkTaskHandle = NULL;
	static void prvFTPTask (void *pvParameters );
#endif

#if( ipconfigMULTI_INTERFACE != 0 )
	NetworkInterface_t *pxSTM32Fxx_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t *pxInterface );
	NetworkInterface_t *pxLoopback_FillInterfaceDescriptor( BaseType_t xEMACIndex, NetworkInterface_t *pxInterface );
#endif /* ipconfigMULTI_INTERFACE */
/*-----------------------------------------------------------*/

#if( ipconfigMULTI_INTERFACE != 0 )
	static NetworkInterface_t xInterfaces[ 2 ];
	static NetworkEndPoint_t xEndPoints[ 4 ];
#endif /* ipconfigMULTI_INTERFACE */

/* Prototypes for the standard FreeRTOS callback/hook functions implemented
within this file. */
EXTERN_C void vApplicationMallocFailedHook( void );
EXTERN_C void vApplicationIdleHook( void );
EXTERN_C void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName );
EXTERN_C void vApplicationTickHook( void );

/*-----------------------------------------------------------*/

static NetworkInterface_t xInterface;
static NetworkEndPoint_t xEndPoints[ 4 ];

#if( ipconfigMULTI_INTERFACE == 1 )

#include "net_setup.h"

static int setup_endpoints()
{
	const char * pcMACAddress = "00-11-11-11-11-47";

	/* Initialise the STM32F network interface structure. */
#if( USE_HOLDEN_INTERFACE == 1 )
    pxSTM32_FillInterfaceDescriptor( 0, &xInterface );
#else
	pxSTM32Fxx_FillInterfaceDescriptor( 0, &xInterface );
#endif
	SetupV4_t setup_v4 =
	{
		.pcMACAddress = pcMACAddress,
		.pcIPAddress = "192.168.2.108",
		.pcMask = "255.255.255.0",
		.pcGateway = "192.168.2.1",
		.eType = eStatic,  /* or eDHCP if you wish. */
//		.eType = eDHCP,
		.pcDNS[0] = "118.98.44.10",
		.pcDNS[1] = "118.98.44.100",
		.pcDNS[2] = "0.0.0.0",
	};

	SetupV4_t setup_v4_second =
	{
		.pcMACAddress = "00-11-11-11-11-07", // pcMACAddress;
		.pcIPAddress = "172.16.0.107",
		.pcMask = "255.255.224.0",
		.pcGateway = "172.16.0.1",
		.eType = eStatic,  /* or eDHCP if you wish. */
//		.eType = eDHCP,
//		.pcDNS[0] = "118.98.44.10",
//		.pcDNS[1] = "118.98.44.100",
	};

	SetupV6_t setup_v6_global =
	{
		.pcMACAddress = pcMACAddress,
		//                             2600:70ff:c066::2001
		.pcIPAddress = "2600:70ff:c066::2001",  /* create it dynamically; based on the prefix. */
		.pcPrefix = "2600:70ff:c066::",
		.uxPrefixLength = 64U,
		.pcGateway = "fe80::ba27:ebff:fe5a:d751",  /* GW will be set during RA or during DHCP. */
		.eType = eStatic,
//		.eType = eRA,  /* Use Router Advertising. */
//		.eType = eDHCP,  /* Use DHCPv6. */
		.pcDNS[0] = "fe80::1",
		.pcDNS[1] = "2001:4860:4860::8888",
	};
	SetupV6_t setup_v6_local =
	{
		.pcMACAddress = pcMACAddress,
		.pcIPAddress = "fe80::7004",  /* A easy-to-remember link-local IP address. */
		.pcPrefix = "fe80::",
		.uxPrefixLength = 10U,
		.eType = eStatic,  /* A fixed IP-address. */
	};

//	xSetupEndpoint_v4( &xInterface, &( xEndPoints[ 1 ] ), &setup_v4_second );
	xSetupEndpoint_v4( &xInterface, &( xEndPoints[ 0 ] ), &setup_v4 );
	xSetupEndpoint_v6( &xInterface, &( xEndPoints[ 2 ] ), &setup_v6_global );
	xSetupEndpoint_v6( &xInterface, &( xEndPoints[ 3 ] ), &setup_v6_local );

	FreeRTOS_IPInit_Multi();
}
#else
static int setup_endpoints()
{
		const uint8_t ucIPAddress[ 4 ] = { 192, 168, 2, 114 };
		const uint8_t ucNetMask[ 4 ] = { 255, 255, 255, 0 };
		const uint8_t ucGatewayAddress[ 4 ] = { 192, 168, 2, 1 };
		const uint8_t ucDNSServerAddress[ 4 ] = { 118, 98, 44, 10 };
//		const uint8_t ucDNSServerAddress[ 4 ] = { 203, 130, 196, 6 };
		FreeRTOS_IPInit( ucIPAddress, ucNetMask, ucGatewayAddress, ucDNSServerAddress, ucMACAddress );
}
#endif

EXTERN_C int main( void );
int main( void )
{
uint32_t ulSeed;

	SCB_EnableICache();
	SCB_EnableDCache();

	/* Reset of all peripherals, Initializes the Flash interface and the Systick. */
	HAL_Init();

	/* Configure the hardware ready to run the demo. */
	prvSetupHardware();

	/* Timer2 initialization function.
	ullGetHighResolutionTime() will be used to get the running time in uS. */
	vStartHighResolutionTimer();

	/* Initialise a heap in SRAM. */
	heapInit( );

#if USE_LOG_EVENT
	iEventLogInit();
#endif

	{
		/* Enable the clock for the RNG. */
		__HAL_RCC_RNG_CLK_ENABLE();
		RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
		RNG->CR |= RNG_CR_RNGEN;

