htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
		/* Set the Instance pointer. */
		hrng.Instance = RNG;
		/* Initialise it. */
		HAL_RNG_Init( &hrng );
		/* Get a random number. */
		HAL_RNG_GenerateRandomNumber( &hrng, &ulSeed );
		/* And pass it to the rand() function. */
	}

	hrng.Instance = RNG;
	HAL_RNG_Init( &hrng );

	/* Initialise the network interface.

	***NOTE*** Tasks that use the network are created in the network event hook
	when the network is connected and ready for use (see the definition of
	vApplicationIPNetworkEventHook() below).  The address values passed in here
	are used if ipconfigUSE_DHCP is set to 0, or if ipconfigUSE_DHCP is set to 1
	but a DHCP server cannot be	contacted. */

	setup_endpoints();

	/* Create the task that handles the FTP and HTTP servers.  This will
	initialise the file system then wait for a notification from the network
	event hook before creating the servers.  The task is created at the idle
	priority, and sets itself to mainTCP_SERVER_TASK_PRIORITY after the file
	system has initialised. */
	xTaskCreate( prvServerWorkTask, "SvrWork", mainTCP_SERVER_STACK_SIZE, NULL, tskIDLE_PRIORITY + 1, &xServerWorkTaskHandle );

	/* Start the RTOS scheduler. */
	FreeRTOS_debug_printf( ("vTaskStartScheduler\n") );
	vTaskStartScheduler();

	/* If all is well, the scheduler will now be running, and the following
	line will never be reached.  If the following line does execute, then
	there was insufficient FreeRTOS heap memory available for the idle and/or
	timer tasks	to be created.  See the memory management section on the
	FreeRTOS web site for more details.  http://www.freertos.org/a00111.html */
	for( ;; )
	{
	}
}
/*-----------------------------------------------------------*/

void HAL_RNG_MspInit(RNG_HandleTypeDef *hrng)
{
	( void ) hrng;
//	RCC_PeriphCLKInitTypeDef PeriphClkInitStruct;
	__HAL_RCC_RNG_CLK_ENABLE();

//	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RTC;
//	PeriphClkInitStruct.RTCClockSelection = RCC_RTCCLKSOURCE_LSI;
//	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
	/* Enable RNG clock source */
	RCC->AHB2ENR |= RCC_AHB2ENR_RNGEN;
	
	/* RNG Peripheral enable */
	RNG->CR |= RNG_CR_RNGEN;

	/*Select PLLQ output as RNG clock source */
//	PeriphClkInitStruct.PeriphClockSelection = RCC_PERIPHCLK_RNG;
//	PeriphClkInitStruct.RngClockSelection = RCC_RNGCLKSOURCE_PLL;
//	HAL_RCCEx_PeriphCLKConfig(&PeriphClkInitStruct);
}

BaseType_t xApplicationGetRandomNumber( uint32_t *pulValue )
{
HAL_StatusTypeDef xResult;
BaseType_t xReturn;
uint32_t ulValue;

	xResult = HAL_RNG_GenerateRandomNumber( &hrng, &ulValue );
	if( xResult == HAL_OK )
	{
		xReturn = pdPASS;
		*pulValue = ulValue;
	}
	else
	{
		xReturn = pdFAIL;
	}
	return xReturn;
}

#if( USE_PLUS_FAT != 0 )
static void prvCreateDiskAndExampleFiles( void )
{
	verboseLevel = 0;
	#if( USE_PLUS_FAT != 0 ) && ( mainHAS_RAMDISK != 0 )
	{
		static uint8_t * pucRAMDiskSpace = NULL;
		if( pucRAMDiskSpace == NULL )
		{
			#define mainRAM_DISK_SECTOR_SIZE	512U
			pucRAMDiskSpace = ( uint8_t * ) malloc( mainRAM_DISK_SECTORS * mainRAM_DISK_SECTOR_SIZE );
			if( pucRAMDiskSpace != NULL )
			{
				FreeRTOS_printf( ( "Create RAM-disk\n" ) );
				/* Create the RAM disk. */
				pxRAMDisk = FF_RAMDiskInit( ( char * ) mainRAM_DISK_NAME, pucRAMDiskSpace, mainRAM_DISK_SECTORS, mainIO_MANAGER_CACHE_SIZE );
				configASSERT( pxRAMDisk );

				/* Print out information on the RAM disk. */
				FF_RAMDiskShowPartition( pxRAMDisk );
			}
		}
	}
	#endif	/* mainHAS_RAMDISK */
	#if( mainHAS_SDCARD != 0 )
	if( pxSDDisk == NULL ) {
		FreeRTOS_printf( ( "Mount SD-card\n" ) );
		/* Create the SD card disk. */
		pxSDDisk = FF_SDDiskInit( mainSD_CARD_DISK_NAME );
		FreeRTOS_printf( ( "Mount SD-card done\n" ) );
		#if( mainRUN_STDIO_TESTS == 1 )
		if( pxSDDisk != NULL )
		{
			/* Remove the base directory again, ready for another loop. */
			ff_deltree( mainSD_CARD_TESTING_DIRECTORY );

			/* Make sure that the testing directory exists. */
			ff_mkdir( mainSD_CARD_TESTING_DIRECTORY MKDIR_RECURSE );

			/* Create a few example files on the disk.  These are not deleted again. */
			vCreateAndVerifyExampleFiles( mainSD_CARD_TESTING_DIRECTORY );

			/* A few sanity checks only - can only be called after 
			vCreateAndVerifyExampleFiles().  NOTE:  The tests take a relatively long 
			time to execute and the FTP and HTTP servers will not start until the 
			tests have completed. */

			vStdioWithCWDTest( mainSD_CARD_TESTING_DIRECTORY );
		}
		#endif

	}
	#endif	/* mainHAS_SDCARD */
}
#endif /* ( USE_PLUS_FAT != 0 ) */
/*-----------------------------------------------------------*/

#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )

#if( USE_PLUS_FAT != 0 )
	static int iFATRunning = 0;

	static void prvFileSystemAccessTask( void *pvParameters )
	{
	const char *pcBasePath = ( const char * ) pvParameters;

		while( iFATRunning != 0 )
		{
			ff_deltree( pcBasePath );
			ff_mkdir( pcBasePath MKDIR_RECURSE );
			vCreateAndVerifyExampleFiles( pcBasePath );
			vStdioWithCWDTest( pcBasePath );
		}
		FreeRTOS_printf( ( "%s: done\n", pcBasePath ) );
		vTaskDelete( NULL );
	}
#endif

#if ( USE_TELNET != 0 )
	Telnet_t * pxTelnetHandle = NULL;

	void vUDPLoggingHook( const char * pcMessage,
						  BaseType_t xLength )
	{
		if( ( pxTelnetHandle != NULL ) && ( pxTelnetHandle->xClients != NULL ) )
		{
/* Skip the telnet logging. */
/*#warning Skip the telnet logging */
			xTelnetSend( pxTelnetHandle, NULL, pcMessage, xLength );
		}
	}
#endif /* if ( USE_TELNET != 0 ) */

#if( ipconfigUSE_DHCP_HOOK != 0 )
	eDHCPCallbackAnswer_t xApplicationDHCPHook( eDHCPCallbackPhase_t eDHCPPhase, uint32_t ulIPAddress )
	{
	eDHCPCallbackAnswer_t eAnswer = eDHCPContinue;

		const char *name = "Unknown";
		switch( eDHCPPhase )
		{
		case eDHCPPhasePreDiscover:
			{
				name = "Discover";			/* Driver is about to send a DHCP discovery. */
	//#warning Testing here
	//			eAnswer = eDHCPUseDefaults;
			}
			break;
		case eDHCPPhasePreRequest:
			{
				name = "Request";			/* Driver is about to request DHCP an IP address. */
	//#warning Testing here
	//			eAnswer = eDHCPUseDefaults;
			}
			break;
		}
		FreeRTOS_printf( ( "DHCP %s address %lxip\n", name, FreeRTOS_ntohl( ulIPAddress ) ) );
		return eAnswer;
	}
#endif	/* ipconfigUSE_DHCP_HOOK */

	void dnsCallback( const char *pcName, void *pvSearchID, uint32_t ulIPAddress)
	{
		FreeRTOS_printf( ( "DNS callback: %s with ID %4d found on %xip\n",
			pcName,
			( unsigned ) pvSearchID,
			( unsigned ) FreeRTOS_ntohl( ulIPAddress ) ) );
	}

