htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
#if( ipconfigUSE_PCAP != 0 )
	#include "win_pcap.h"

	/* SPcap can gather Ethernet packets in RAM and write them to disk. */
	SPcap myPCAP;
	static BaseType_t pcapRunning = pdFALSE;
	static char pcPCAPFname[ 80 ];
	TickType_t xPCAPStartTime;
	unsigned xPCAPMaxTime;
	#define PCAP_SIZE    ( 1024U )

	static void pcap_check( void )
	{
		if( pcapRunning )
		{
			TickType_t xNow = xTaskGetTickCount ();
			TickType_t xDiff = ( xNow - xPCAPStartTime ) / configTICK_RATE_HZ;
			BaseType_t xTimeIsUp = ( ( xPCAPMaxTime > 0U ) && ( xDiff > xPCAPMaxTime ) ) ? 1 : 0;
			if( xPCAPStartTime == 1 )
			{
				xTimeIsUp = 1;
			}
			if( xTimeIsUp != 0 )
			{
				FreeRTOS_printf( ( "PCAP time is up\n" ) );
			}
			if( ( xTimeIsUp != 0 ) || ( pcap_has_space( &( myPCAP ) ) < 2048 ) )
			{
				pcap_toFile( &( myPCAP ), pcPCAPFname );
				pcap_clear( &( myPCAP ) );
				pcapRunning = pdFALSE;
				FreeRTOS_printf( ( "PCAP ready with '%s'\n", pcPCAPFname ) );
			}
		}
	}

	void pcap_store( uint8_t * pucBytes, size_t uxLength )
	{
		if( pcapRunning )
		{
			IPPacket_t * pxIPPacket = ( IPPacket_t * ) pucBytes;
			IPHeader_t * pxIPHeader = &( pxIPPacket->xIPHeader );
			uint8_t ucProtocol = pxIPPacket->xIPHeader.ucProtocol;
			if( pxIPPacket->xIPHeader.ulSourceIPAddress == FreeRTOS_GetIPAddress())
			{
				switch( ucProtocol )
				{
				case ipPROTOCOL_ICMP:
				case ipPROTOCOL_UDP:
				case ipPROTOCOL_TCP:
                    pxIPHeader->usHeaderChecksum = 0x00U;
                    pxIPHeader->usHeaderChecksum = usGenerateChecksum( 0U, ( uint8_t * ) &( pxIPHeader->ucVersionHeaderLength ), ipSIZE_OF_IPv4_HEADER );
                    pxIPHeader->usHeaderChecksum = ~FreeRTOS_htons( pxIPHeader->usHeaderChecksum );

					usGenerateProtocolChecksum( pucBytes, uxLength, pdTRUE );
					break;
				}
			}
			pcap_write( &myPCAP, pucBytes, ( int ) uxLength );
		}
	}

	static void pcap_command( char *pcBuffer )
	{
		char *ptr = pcBuffer;
		while( isspace( *ptr ) ) ptr++;
		if( *ptr == 0 )
		{
			FreeRTOS_printf( ( "Usage: pcap /test.pcap 1024 100\n" ) );
			FreeRTOS_printf( ( "Which records 1024 KB\n" ) );
			FreeRTOS_printf( ( "Lasting at most 100 seconds\n" ) );
			return;
		}
		if( strncmp( ptr, "stop", 4 )  == 0 )
		{
			if( pcapRunning )
			{
				FreeRTOS_printf( ( "Trying to stop PCAP\n" ) );
				xPCAPStartTime = 1U;
				pcap_check();
			}
			else
			{
				FreeRTOS_printf( ( "PCAP was not running\n" ) );
			}
		}
		else if( pcapRunning )
		{
			FreeRTOS_printf( ( "PCAP is still running\n" ) );
		}
		else
		{
			xPCAPMaxTime = 0U;
			const char *fname = ptr;
			unsigned length = PCAP_SIZE;
			while( *ptr && !isspace( *ptr ) )
			{
				ptr++;
			}
			while( isspace( *ptr ) )
			{
				*ptr = 0;
				ptr++;
			}
			if( isdigit( *ptr ) )
			{
				if( sscanf( ptr, "%u", &length) > 0 )
				{
					while( *ptr && !isspace( *ptr ) )
					{
						ptr++;
					}
					while( isspace( *ptr ) ) ptr++;
					sscanf( ptr, "%u", &xPCAPMaxTime);
				}
			}
			snprintf(pcPCAPFname, sizeof pcPCAPFname, "%s", fname);

			if( pcap_init( &( myPCAP ), length * 1024U ) == pdTRUE )
			{
				xPCAPStartTime = xTaskGetTickCount ();
				pcapRunning = pdTRUE;
				FreeRTOS_printf( ( "PCAP recording %u KB to '%s' for %u sec\n",
					length * 1024U, pcPCAPFname, xPCAPMaxTime ) );
			}
		}
	}

#endif

	static void prvServerWorkTask( void *pvParameters )
	{
	const TickType_t xInitialBlockTime = pdMS_TO_TICKS( 10UL );

	/* A structure that defines the servers to be created.  Which servers are
	included in the structure depends on the mainCREATE_HTTP_SERVER and
	mainCREATE_FTP_SERVER settings at the top of this file. */
	static const struct xSERVER_CONFIG xServerConfiguration[] =
	{
		#if( mainCREATE_HTTP_SERVER == 1 )
				/* Server type,		port number,	backlog, 	root dir. */
				{ eSERVER_HTTP, 	80, 			12, 		configHTTP_ROOT },
		#endif

		#if( mainCREATE_FTP_SERVER == 1 )
				/* Server type,		port number,	backlog, 	root dir. */
				{ eSERVER_FTP,  	21, 			12, 		"" }
		#endif
	};

	BaseType_t xHadSocket = pdFALSE;
	BaseType_t xHasBlocked = pdFALSE;

		/* Remove compiler warning about unused parameter. */
		( void ) pvParameters;

		/* Wait until the network is up before creating the servers.  The
		notification is given from the network event hook. */
		ulTaskNotifyTake( pdTRUE, portMAX_DELAY );

		FreeRTOS_printf( ( "Creating files\n" ) );

		/* Create the disk used by the FTP and HTTP servers. */
		#if( USE_PLUS_FAT != 0 )
			prvCreateDiskAndExampleFiles();
			BaseType_t xIsPresent = FF_SDDiskDetect( pxSDDisk );
			FreeRTOS_printf( ( "FF_SDDiskDetect returns -> %d\n", ( int ) xIsPresent  ) );
		#endif

		/* The priority of this task can be raised now the disk has been
		initialised. */
		vTaskPrioritySet( NULL, mainTCP_SERVER_TASK_PRIORITY );

		/* Wait until the network is up before creating the servers.  The
		notification is given from the network event hook. */
//		ulTaskNotifyTake( pdTRUE, portMAX_DELAY );

		/* Create the servers defined by the xServerConfiguration array above. */
		#if( USE_PLUS_FAT != 0 )
			pxTCPServer = FreeRTOS_CreateTCPServer( xServerConfiguration, sizeof( xServerConfiguration ) / sizeof( xServerConfiguration[ 0 ] ) );
			configASSERT( pxTCPServer );
		#endif

		#if( CONFIG_USE_LWIP != 0 )
		{
			/* Earlier testing with a dual-stack. */
			vLWIP_Init();
		}
		#endif
		xServerSemaphore = xSemaphoreCreateBinary();
		char pcBuffer[ 64 ];

		#if ( USE_TELNET != 0 )
			Telnet_t xTelnet;
			memset( &xTelnet, '\0', sizeof xTelnet );
		#endif

		for( ;; )
		{
			if (xStartServices == EStartupStart) {
				xStartServices = EStartupStarted;
				strcpy( pcBuffer, "ntp" );
#if( USE_PLUS_FAT != 0 )
				xHandleTestingCommand( pcBuffer, sizeof pcBuffer );
				xTaskCreate( prvFTPTask, "FTP-task", mainFAT_SERVER_STACK_SIZE, NULL, tskIDLE_PRIORITY + 2, &xFTPWorkTaskHandle );
#endif
			}
			/* tcpServerWork() is yet another test. */
			tcpServerWork();

			xHasBlocked = pdFALSE;

			#if( configUSE_TIMERS == 0 )
			{
				/* As there is not Timer task, toggle the LED 'manually'. */
//				vParTestToggleLED( mainLED );
				HAL_GPIO_TogglePin(GPIOG, GPIO_PIN_6);
			}
			#endif
			xSocket_t xSocket = xLoggingGetSocket();
			struct freertos_sockaddr xSourceAddress;
			socklen_t xSourceAddressLength = sizeof( xSourceAddress );

			if( !xHasBlocked )
			{
				xSemaphoreTake( xServerSemaphore, 10 );
			}

			if( xSocket != NULL)
			{
			BaseType_t xCount;

			TickType_t xReceiveTimeOut = pdMS_TO_TICKS( 0 );

