htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
				#if( ipconfigUSE_PCAP != 0 )
				{
					pcap_check();
				}
				#endif

				#if( USE_TCP_DEMO_CLI != 0 )
				{
					xHandleTesting();
				}
				#endif
				if( xHadSocket == pdFALSE )
				{
					xHadSocket = pdTRUE;
					FreeRTOS_printf( ( "prvCommandTask started. Multi = %d IPv6 = %d\n",
						ipconfigMULTI_INTERFACE,
						ipconfigUSE_IPv6) );

					FreeRTOS_setsockopt( xSocket, 0, FREERTOS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );
				#if ( USE_TELNET != 0 )
					{
						extern TickType_t uxTelnetAcceptTmout;
						uxTelnetAcceptTmout = pdMS_TO_TICKS( 0U );
						xTelnetCreate( &xTelnet, TELNET_PORT_NUMBER );

						if( xTelnet.xParentSocket != 0 )
						{
							FreeRTOS_setsockopt( xTelnet.xParentSocket, 0, FREERTOS_SO_SET_SEMAPHORE, ( void * ) &xServerSemaphore, sizeof( xServerSemaphore ) );
							pxTelnetHandle = &xTelnet;
						}

						/* For testing only : start up a second telnet server. */
/*						xSetupTelnet(); */
					}
					#endif /* if ( USE_TELNET != 0 ) */
				}
//				xCount = FreeRTOS_recvfrom( xSocket, ( void * )pcBuffer, sizeof( pcBuffer ) - 1,
//						xHasBlocked ? 0 : FREERTOS_MSG_DONTWAIT, &xSourceAddress, &xSourceAddressLength );
				xCount = FreeRTOS_recvfrom( xSocket, ( void * )pcBuffer, sizeof( pcBuffer ) - 1,
						0, &xSourceAddress, &xSourceAddressLength );
			#if ( USE_TELNET != 0 )
				{
					if( xCount <= 0 ) /*  && ( xTelnet.xParentSocket != NULL ) ) */
					{
						struct freertos_sockaddr fromAddr;
						xCount = xTelnetRecv( &xTelnet, &fromAddr, pcBuffer, sizeof( pcBuffer ) - 1 );

						if( xCount > 0 )
						{
							xTelnetSend( &xTelnet, &fromAddr, pcBuffer, xCount );
						}
					}
				}
			#endif /* if ( USE_TELNET != 0 ) */
				if( xCount > 0 )
				{
					pcBuffer[ xCount ] = '\0';
					if (pcBuffer[0] == 'f' && isdigit (pcBuffer[1]) && pcBuffer[2] == ' ') {
						// Ignore messages like "f4 dnsq"
						if (pcBuffer[1] != '7')
							continue;
						xCount -= 3;
						// "f7 ver"
						memmove(pcBuffer, pcBuffer+3, xCount + 1);
					}

					#if( USE_TCP_DEMO_CLI != 0 )
					if( xHandleTestingCommand( pcBuffer, sizeof( pcBuffer ) ) == pdTRUE )
					{
						/* Command has been handled. */
					}
					else
					#endif /* ( USE_TCP_DEMO_CLI != 0 ) */
					if( vHandleOtherCommand( xSocket, pcBuffer ) == pdTRUE )
					{
						/* Command has been handled locally. */
					}
					else
					{
						FreeRTOS_printf( ( "Unknown command: '%s'\n", pcBuffer ) );
					}
				}	/* if( xCount > 0 ) */
			}	/* if( xSocket != NULL) */
		}
	}

#endif /* ( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) ) */
/*-----------------------------------------------------------*/

#if( USE_PLUS_FAT != 0 )
static void check_disk_presence()
{
    /* Check if the SD-card was inserted or extracted. */
	static BaseType_t xWasPresent = pdFALSE;
	BaseType_t xIsPresent = FF_SDDiskDetect( pxSDDisk );
	if (xWasPresent != xIsPresent )
	{
		if( xIsPresent == pdFALSE )
		{
			FreeRTOS_printf( ( "SD-card now removed (%ld -> %ld)\n", xWasPresent, xIsPresent ) );
			if( ( pxSDDisk != NULL ) && ( pxSDDisk->pxIOManager != NULL ) )
			{
				/* Invalidate all open file handles so they
				will get closed by the application. */
				FF_Invalidate( pxSDDisk->pxIOManager );
				FF_SDDiskUnmount( pxSDDisk );
			}
		}
		else
		{
			FreeRTOS_printf( ( "SD-card now present (%ld -> %ld)\n", xWasPresent, xIsPresent ) );
			if( pxSDDisk != NULL )
			{
			BaseType_t xResult;
				FF_SDDiskReinit( pxSDDisk );
				xResult = FF_SDDiskMount( pxSDDisk );
				FF_PRINTF( "FF_SDDiskMount: SD-card %s\n", xResult > 0 ? "OK" : "Failed" );
//				if( xResult > 0 )
//				{
//					FF_SDDiskShowPartition( pxSDDisk );
//				}
			}
			else
			{
				prvCreateDiskAndExampleFiles();
			}
		}
		xWasPresent = xIsPresent;
	}
}
#endif /* #if( USE_PLUS_FAT != 0 ) */

typedef struct xParameters
{
	int parameters[16];
	const char * texts[16];
	int txtCount;
	int parCount;
	int ipCount;
} SParameters;

static int analyseCommand(SParameters *apPars, char *pcBuffer)
{
	const char *ptr = pcBuffer;
	apPars->txtCount = 0;
	apPars->parCount = 0;
	apPars->ipCount = 0;

	memset(apPars->parameters, '\0', sizeof apPars->parameters);
	memset(apPars->texts, '\0', sizeof apPars->texts);

	while (*ptr && !isdigit (*ptr) && *ptr != '-') ptr++;

	while (apPars->parCount < ARRAY_SIZE(apPars->parameters))
	{
		char isHex = pdFALSE;
		char negative = pdFALSE;
		while (*ptr) {
			if (ptr[0] == '0' && ptr[1] == 'x' && isxdigit (ptr[2])) {
				ptr += 2;
				isHex = pdTRUE;
				break;
			}
			if (ptr[0] == '-' && isdigit (ptr[1])) {
				ptr += 1;
				negative = pdTRUE;
				break;
			}
			if (isdigit (*ptr))
				break;
			ptr++;
		}
		if (!*ptr)
			break;
		if (isHex) {
			sscanf (ptr, "%x", &apPars->parameters[apPars->parCount]);
			while (isxdigit (*ptr)) ptr++;
		} else {
			unsigned n;
			sscanf (ptr, "%u", &n);
			if (apPars->ipCount) {
				*((unsigned*)apPars->parameters+apPars->parCount) =
					(((unsigned)apPars->parameters[apPars->parCount]) << 8) | n;
			} else if (negative) {
				apPars->parameters[apPars->parCount] = - ((int)n);
			} else {
				apPars->parameters[apPars->parCount] = n;
			}
			while (isdigit (*ptr)) ptr++;
			if (*ptr == '.') {
				apPars->parCount--;
				apPars->ipCount++;
			} else {
				apPars->ipCount = 0;
			}
		}
		apPars->parCount++;
	}

	for (char *token = strtok(pcBuffer, " ");
		 token != NULL;
		 token = strtok(NULL, " ")) {

		apPars->texts[apPars->txtCount++] = token;
		if (apPars->txtCount >= ARRAY_SIZE(apPars->texts))
			break;
	}
	while (apPars->txtCount < ARRAY_SIZE(apPars->texts)) {
		static const char zeroString[1] = { 0 };
		apPars->texts[apPars->txtCount++] = zeroString;
	}
	return apPars->parCount;
}

static BaseType_t vHandleOtherCommand( Socket_t xSocket, char *pcBuffer )
{
	/* Assume that the command will be handled. */
    BaseType_t xReturn = pdTRUE;

	( void ) xSocket;

	SParameters pars;
	analyseCommand(&pars, pcBuffer);

	if( strncmp( pcBuffer, "ver", 3 ) == 0 )
	{
	int level;
	TickType_t xCount = xTaskGetTickCount();
		if( sscanf( pcBuffer + 3, "%d", &level ) == 1 )
		{
			verboseLevel = level;
		}
		FreeRTOS_printf( ( "Verbose level %d time %lu\n", verboseLevel, xCount ) );
	}
#if( HAS_AUDIO != 0 )
	else if( strncmp( pcBuffer, "audio", 5 ) == 0 )
	{
		static TaskHandle_t xTaskHandle = NULL;
		extern unsigned audioTick;
		if (xTaskHandle == NULL)
		{
			void audioTask (void * pvParameter);
			xTaskCreate( audioTask, "AudioTask", 2048, NULL, tskIDLE_PRIORITY + 1, &xTaskHandle );
			logPrintf("Audio task %sstarted\n", (xTaskHandle == NULL) ? "not " : "");
		}
		unsigned seconds = 10;
		const char *command = pars.txtCount >= 2 ? pars.texts[1] : "test";
		const char *fname   = pars.txtCount >= 3 ? pars.texts[2] : "/temp/file_01.wav";
		const char *secs    = pars.txtCount >= 4 ? pars.texts[3] : "10";
		sscanf (secs, "%u", &seconds);
		if( strncmp( command, "record", 6 ) == 0 )
		{
			audioRecord (fname, seconds);
			logPrintf("Record to %s for %u secs\n", fname, seconds);
		}
		else if( strncmp( command, "play", 6 ) == 0 )
		{
			audioPlay (fname, seconds);
			logPrintf("Play from %s for %u secs\n", fname, seconds);
		}
		else if( strncmp( command, "test", 4 ) == 0 )
		{
			audioTick++;
		}
	}
#endif
	else if( memcmp( pcBuffer, "mem", 3 ) == 0 )
	{
		uint32_t now = xPortGetFreeHeapSize();
		uint32_t total = 0; /*xPortGetOrigHeapSize( ); */
		uint32_t perc = total ? ( ( 100 * now ) / total ) : 100;
		FreeRTOS_printf( ( "mem Low %u, Current %lu / %lu (%lu perc free)\n",
						   xPortGetMinimumEverFreeHeapSize(),
						   now, total, perc ) );
	}
	else if( memcmp( pcBuffer, "pars", 4 ) == 0 )
	{
		logPrintf("pars[%d] '%d' '%d' '%d' '%d'\n",
			pars.parCount,
			pars.parameters[0],
			pars.parameters[1],
			pars.parameters[2],
			pars.parameters[3]);
		logPrintf("texts[%d] '%s' '%s' '%s' '%s'\n",
			pars.txtCount,
			pars.texts[0],
			pars.texts[1],
			pars.texts[2],
			pars.texts[3]);
	}
#if( ipconfigUSE_IPv6 != 0 )
	else if( strncmp( pcBuffer, "sizes", 5 ) == 0 )
	{
		FreeRTOS_printf( ( "ipconfigNETWORK_MTU %u IPv6_HEADER %u IPv4_HEADER %u ipSIZE_OF_TCP_HEADER %u\n",
			( unsigned ) ipconfigNETWORK_MTU,
			( unsigned ) ipSIZE_OF_IPv6_HEADER,
			( unsigned ) ipSIZE_OF_IPv4_HEADER,
			( unsigned ) ipSIZE_OF_TCP_HEADER ) );
		#define ipconfigTCP_MSS_6	   ( ipconfigNETWORK_MTU - ( ipSIZE_OF_IPv6_HEADER + ipSIZE_OF_TCP_HEADER ) )
		#define ipconfigTCP_MSS_4	   ( ipconfigNETWORK_MTU - ( ipSIZE_OF_IPv4_HEADER + ipSIZE_OF_TCP_HEADER ) )
		FreeRTOS_printf( ( "ipconfigTCP_MSS = %u and %u\n", ipconfigTCP_MSS_4, ipconfigTCP_MSS_6 ) );
	}
#endif
	else if( strncmp( pcBuffer, "tcptest", 7 ) == 0 )
	{
		tcpServerStart();
	}
#if( USE_MBEDTLS != 0 )
	else if( strncmp( pcBuffer, "ssltest", 7 ) == 0 )
	{
		extern int ssl_main( int argc, char *argv[] );
		char * argv[] =
		{
			"ssl_main",
			"server_port=443",
			"request_page=/",
			"ca_path=/etc/certs",
			"server_name=google.com",
			"dtls=0",
		};
		ssl_main( ARRAY_SIZE( argv ), argv );
	}
#endif
	else if( ( strncmp( pcBuffer, "memstat", 7 ) == 0 ) || ( strncmp( pcBuffer, "mem_stat", 8 ) == 0 ) )
	{
#if( ipconfigUSE_TCP_MEM_STATS != 0 )
		FreeRTOS_printf( ( "Closing mem_stat\n" ) );
		iptraceMEM_STATS_CLOSE();
#else
		FreeRTOS_printf( ( "ipconfigUSE_TCP_MEM_STATS was not defined\n" ) );
#endif	/* ( ipconfigUSE_TCP_MEM_STATS != 0 ) */
	}
//	else if( strncmp( pcBuffer, "mymalloc", 8 ) == 0 )
//	{
//		uint8_t * mem = ( uint8_t * ) myMalloc( 64, pdFALSE );
//		if( mem )
//		{
//			free( mem );
//		}
//		logPrintf( "maMalloc = %p\n", mem );
//	}
	else if( strncmp( pcBuffer, "time", 4 ) == 0 )
	{
		time_t currentTime;
		extern time_t time ( time_t *puxTime );

