htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
		time( &( currentTime ) );
		FreeRTOS_printf( ( "Current time %u TickCount %u HR-time %u\n",
			( unsigned ) currentTime,
			( unsigned ) xTaskGetTickCount(),
			( unsigned ) ullGetHighResolutionTime() ) );
	}
#if( HAS_ECHO_TEST != 0 )
	else if( strncmp( pcBuffer, "plus abort", 10 ) == 0 )
	{
		FreeRTOS_printf( ( "Change uxServerAbort from %d\n", uxServerAbort ) );
		uxServerAbort = pdTRUE;
	}
	else if( strncmp( pcBuffer, "plus", 4 ) == 0 )
	{
		int iDoStart = 1;
		char *ptr = pcBuffer+4;
		while (*ptr && !isdigit(*ptr)) ptr++;
		if (!ulServerIPAddress)
			ulServerIPAddress = FreeRTOS_GetIPAddress();
		if (*ptr) {
			int value2;
			char ch;
			char *tail = ptr;
			int rc = sscanf (ptr, "%d%c%d", &iDoStart, &ch, &value2);

			while( *tail && !isspace( *tail ) ) tail++;
			if( isspace( *tail ) )
			{
				*(tail++) = 0;
				while( isspace( *tail ) ) tail++;
			}

			if (rc >= 3) {
				ulServerIPAddress = FreeRTOS_inet_addr( ptr );
				iDoStart = 1;
			} else if (rc < 1) {
				iDoStart = 0;
			}
			if( *tail )
			{
				unsigned uValue;
				if( sscanf( tail, "%u", &uValue) >= 1 )
				{
					FreeRTOS_printf( ( "Exchange %u bytes\n", uValue ) );
					uxClientSendCount = uValue;
				}
			}
		}
		plus_echo_start (iDoStart);
		FreeRTOS_printf( ( "Plus testing has %s for %xip\n", iDoStart ? "started" : "stopped",
			( unsigned ) FreeRTOS_ntohl( ulServerIPAddress ) ) );
	}
#endif /* ( HAS_ECHO_TEST != 0 ) */
	else if( strncmp( pcBuffer, "netstat", 7 ) == 0 )
	{
		FreeRTOS_netstat();
	}
#if( ipconfigUSE_PCAP != 0 )
    else if( strncmp( pcBuffer, "pcap", 4 ) == 0 )
	{
		FreeRTOS_printf( ( "PCAP: %s\n", pcBuffer ) );
		pcap_command( pcBuffer + 4 );
	}
#endif
	#if( USE_LOG_EVENT != 0 )
	else if( strncmp( pcBuffer, "event", 4 ) == 0 )
	{
		eventLogDump();
	}
	#endif /* USE_LOG_EVENT */
	else if( strncmp( pcBuffer, "list", 4 ) == 0 )
	{
		vShowTaskTable( pcBuffer[ 4 ] == 'c' );
	}
//	if( strncmp( pcBuffer, "phytest", 7 ) == 0 )
//	{
//		extern void phy_test();
//		phy_test();
//	}
	#if( mainHAS_RAMDISK != 0 )
//	else if( strncmp( pcBuffer, "dump", 4 ) == 0 )
//	{
//		FF_RAMDiskStoreImage( pxRAMDisk, "ram_disk.img" );
//	}
	#endif	/* mainHAS_RAMDISK */
	#if( USE_IPERF != 0 )
	else if( strncmp( pcBuffer, "iperf", 5 ) == 0 )
	{
		vIPerfInstall();
	}
	#endif	/* USE_IPERF */
	else if( strncmp( pcBuffer, "format", 6 ) == 0 )
	{
		if( pxSDDisk != 0 )
		{
			FF_SDDiskFormat( pxSDDisk, 0 );
		}
	}
	#if( mainHAS_FAT_TEST != 0 )
	else if( strncmp( pcBuffer, "fattest", 7 ) == 0 )
	{
	int level = 0;
	const char pcMountPath[] = "/test";

		if( sscanf( pcBuffer + 7, "%d", &level ) == 1 )
		{
			verboseLevel = level;
		}
		FreeRTOS_printf( ( "FAT test %d\n", level ) );
		ff_mkdir( pcMountPath MKDIR_RECURSE );
		if( ( level != 0 ) && ( iFATRunning == 0 ) )
		{
		int x;

			iFATRunning = 1;
			if( level < 1 ) level = 1;
			if( level > 10 ) level = 10;
			for( x = 0; x < level; x++ )
			{
			char pcName[ 16 ];
			static char pcBaseDirectoryNames[ 10 ][ 16 ];
			sprintf( pcName, "FAT_%02d", x + 1 );
			snprintf( pcBaseDirectoryNames[ x ], sizeof pcBaseDirectoryNames[ x ], "%s/%d",
					pcMountPath, x + 1 );
			ff_mkdir( pcBaseDirectoryNames[ x ] MKDIR_RECURSE );

#define mainFAT_TEST__TASK_PRIORITY	( tskIDLE_PRIORITY + 1 )
				xTaskCreate( prvFileSystemAccessTask,
							 pcName,
							 mainFAT_TEST_STACK_SIZE,
							 ( void * ) pcBaseDirectoryNames[ x ],
							 mainFAT_TEST__TASK_PRIORITY,
							 NULL );
			}
		}
		else if( ( level == 0 ) && ( iFATRunning != 0 ) )
		{
			iFATRunning = 0;
			FreeRTOS_printf( ( "FAT test stopped\n" ) );
		}
	}	/* if( strncmp( pcBuffer, "fattest", 7 ) == 0 ) */
	#endif /* mainHAS_FAT_TEST */
	else
	{
		xReturn = pdFALSE;
	}

	return xReturn;
}

uint32_t echoServerIPAddress()
{
	return ulServerIPAddress;
}
/*-----------------------------------------------------------*/

uint32_t HAL_GetTick(void)
{
	/* This timer can be used before the scheduler has started.
	 * The high-resolution timer returns the time since startup
	 * in micro-seconds. */
	uint32_t ulCurTime = ( ullGetHighResolutionTime() / 1000ull );
	return ulCurTime;
}


static void prvSetupHardware( void )
{
	GPIO_InitTypeDef  GPIO_InitStruct;

	/* Configure Flash prefetch and Instruction cache through ART accelerator. */
	#if( ART_ACCLERATOR_ENABLE != 0 )
	{
		__HAL_FLASH_ART_ENABLE();
	}
	#endif /* ART_ACCLERATOR_ENABLE */

	/* Set Interrupt Group Priority */
	HAL_NVIC_SetPriorityGrouping( NVIC_PRIORITYGROUP_4 );

	/* Init the low level hardware. */
	HAL_MspInit();

	/* Configure the System clock to have a frequency of 200 MHz */
	prvSystemClockConfig();

	/* Enable GPIOB  Clock (to be able to program the configuration
	registers) and configure for LED output. */
	/* GPIO Ports Clock Enable */
	__GPIOE_CLK_ENABLE();
	__GPIOB_CLK_ENABLE();
	__GPIOG_CLK_ENABLE();
	__GPIOD_CLK_ENABLE();
	__GPIOC_CLK_ENABLE();
	__GPIOA_CLK_ENABLE();
	__GPIOI_CLK_ENABLE();
	__GPIOH_CLK_ENABLE();
	__GPIOF_CLK_ENABLE();

	__HAL_RCC_GPIOF_CLK_ENABLE();

	GPIO_InitStruct.Pin = GPIO_PIN_10;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	HAL_GPIO_Init( GPIOF, &GPIO_InitStruct );

	/* MCO2 : Pin PC9 */
	HAL_RCC_MCOConfig( RCC_MCO2, RCC_MCO2SOURCE_SYSCLK, RCC_MCODIV_1 );
}
/*-----------------------------------------------------------*/

void BM_Delay( uint32_t ulDelayMS )
{
	/* BSP_SDRAM_Init() initialises the SDRAM driver. 
	 * It is called far before the scheduler is running.
	 * This function will use the HR-timer to measure time. */
	uint32_t ulStartTime = HAL_GetTick();
	for( ;; )
	{
		uint32_t ulNow = HAL_GetTick();
		if( ( ulNow - ulStartTime ) > ulDelayMS )
		{
			break;
		}
	}
}
/*-----------------------------------------------------------*/

static void prvSystemClockConfig( void )
{
	/* The system Clock is configured as follow :
		System Clock source            = PLL (HSE)
		SYSCLK(Hz)                     = 200000000
		HCLK(Hz)                       = 200000000
		AHB Prescaler                  = 1
		APB1 Prescaler                 = 4
		APB2 Prescaler                 = 2
		HSE Frequency(Hz)              = 25000000
		PLL_M                          = 25
		PLL_N                          = 400
		PLL_P                          = 2
		PLL_Q                          = 7
		VDD(V)                         = 3.3
		Main regulator output voltage  = Scale1 mode
		Flash Latency(WS)              = 7 */
	RCC_ClkInitTypeDef RCC_ClkInitStruct;
	RCC_OscInitTypeDef RCC_OscInitStruct;

	/* Enable HSE Oscillator and activate PLL with HSE as source */
	RCC_OscInitStruct.OscillatorType = RCC_OSCILLATORTYPE_HSE;
	RCC_OscInitStruct.HSEState = RCC_HSE_ON;
	RCC_OscInitStruct.HSIState = RCC_HSI_OFF;
	RCC_OscInitStruct.PLL.PLLState = RCC_PLL_ON;
	RCC_OscInitStruct.PLL.PLLSource = RCC_PLLSOURCE_HSE;
	RCC_OscInitStruct.PLL.PLLM = 25;
	RCC_OscInitStruct.PLL.PLLN = 400;
	RCC_OscInitStruct.PLL.PLLP = RCC_PLLP_DIV2;
	RCC_OscInitStruct.PLL.PLLQ = 7;
	HAL_RCC_OscConfig(&RCC_OscInitStruct);

	/* Select PLL as system clock source and configure the HCLK, PCLK1 and PCLK2
	clocks dividers */
	RCC_ClkInitStruct.ClockType = (RCC_CLOCKTYPE_SYSCLK | RCC_CLOCKTYPE_HCLK | RCC_CLOCKTYPE_PCLK1 | RCC_CLOCKTYPE_PCLK2);
	RCC_ClkInitStruct.SYSCLKSource = RCC_SYSCLKSOURCE_PLLCLK;
	RCC_ClkInitStruct.AHBCLKDivider = RCC_SYSCLK_DIV1;
	RCC_ClkInitStruct.APB1CLKDivider = RCC_HCLK_DIV4;
	RCC_ClkInitStruct.APB2CLKDivider = RCC_HCLK_DIV2;
	configASSERT( HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_7) == HAL_OK );
}
/*-----------------------------------------------------------*/

/* The following hook-function will be called from "STM32F4xx\ff_sddisk.c"
in case the GPIO contact of the card-detect has changed. */

EXTERN_C void vApplicationCardDetectChangeHookFromISR( BaseType_t *pxHigherPriorityTaskWoken );

void vApplicationCardDetectChangeHookFromISR( BaseType_t *pxHigherPriorityTaskWoken )
{
	/* This routine will be called on every change of the Card-detect
	GPIO pin.  The TCP server is probably waiting for in event in a
	select() statement.  Wake it up.*/
	if( pxTCPServer != NULL )
	{
		FreeRTOS_TCPServerSignalFromISR( pxTCPServer, pxHigherPriorityTaskWoken );
	}
}
/*-----------------------------------------------------------*/
#ifdef USE_FULL_ASSERT
	/**
	 * @brief Reports the name of the source file and the source line number
	 * where the assert_param error has occurred.
	 * @param file: pointer to the source file name
	 * @param line: assert_param error line source number
	 * @retval None
	 */

	volatile const char *assert_fname = NULL;
	volatile int assert_line = 0;
	volatile int assert_may_proceed = 0;

