htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
	void assert_failed(uint8_t* pucFilename, uint32_t ulLineNr)
	{
		assert_fname = ( const char * ) pucFilename;
		assert_line = ( int ) ulLineNr;
		taskDISABLE_INTERRUPTS();
		while( assert_may_proceed == pdFALSE )
		{
		}
		taskENABLE_INTERRUPTS();

	}
#endif
/*-----------------------------------------------------------*/

static BaseType_t xMatchDNS( const char * pcObject, const char * pcMyName )
{
taskENTER_CRITICAL();
	BaseType_t rc = -1;
	size_t uxLength = strlen( pcMyName );
	const char *pcDot = strchr( pcObject, '.' );
#if( ipconfigUSE_MDNS == 1 )
	if( pcDot != NULL )
	{
		if( strcasecmp( pcDot, ".local" ) == 0 )
		{
			uxLength -= 6U;
			rc = strncasecmp( pcMyName, pcObject, uxLength );
		}
	}
	else
#endif
	{
		rc = strncasecmp( pcMyName, pcObject, uxLength );
	}
	/*
	 * "zynq" matches "zynq.local".
	 */
taskEXIT_CRITICAL();
	return rc;
}

#if( ipconfigMULTI_INTERFACE != 0 )
#warning Multi
	EXTERN_C BaseType_t xApplicationDNSQueryHook_Multi( NetworkEndPoint_t *pxEndPoint, const char *pcName )
#else
#warning Single
	EXTERN_C BaseType_t xApplicationDNSQueryHook( const char *pcName )
#endif
{
BaseType_t xReturn;

	/* Determine if a name lookup is for this node.  Two names are given
	to this node: that returned by pcApplicationHostnameHook() and that set
	by mainDEVICE_NICK_NAME. */
	if( xMatchDNS( pcName, pcApplicationHostnameHook() ) == 0 )  /* "stm" */
	{
		xReturn = pdPASS;
	}
	else if( xMatchDNS( pcName, mainDEVICE_NICK_NAME ) == 0 )  /* "stm32f7" */
	{
		xReturn = pdPASS;
	}
	else if( xMatchDNS( pcName, "hs2011" ) == 0 )
	{
		xReturn = pdPASS;
	}
	else if( xMatchDNS( pcName, "aap" ) == 0 )
	{
#if( ipconfigUSE_IPv6 != 0 )
		xReturn = pxEndPoint->bits.bIPv6 != 0;
#else
		xReturn = pdPASS;
#endif
	}
	else if( xMatchDNS( pcName, "kat" ) == 0 )
	{
#if( ipconfigUSE_IPv6 != 0 )
		xReturn = pxEndPoint->bits.bIPv6 == 0;
		unsigned number = 0;
		if( sscanf( pcName + 3, "%u", &number) > 0 )
		{
			if( number == 172 )
			{
				pxEndPoint->ipv4_settings.ulIPAddress = FreeRTOS_inet_addr_quick( 172,  16,   0, 114 );
			}
			else
			if( number == 192 )
			{
			NetworkEndPoint_t *px;

				for( px = FreeRTOS_FirstEndPoint( NULL );
					px != NULL;
					px = FreeRTOS_NextEndPoint( NULL, px ) )
				{
					if( px->bits.bIPv6 == pdFALSE_UNSIGNED )
					{
						break;
					}
				}
				if( px != NULL )
				{
					pxEndPoint->ipv4_settings.ulIPAddress = px->ipv4_settings.ulIPAddress;
				}
				else
				{
					pxEndPoint->ipv4_settings.ulIPAddress = FreeRTOS_inet_addr_quick( 192,  168,   2, 114 );
				}
			}
		}
#else
		xReturn = pdPASS;
#endif
	}
	else
	{
		xReturn = pdFAIL;
	}
	#if( ipconfigUSE_IPv6 != 0 )
	{
		if( ( allowIPVersion & eIPv4 ) == 0 && !pxEndPoint->bits.bIPv6 )
		{
			xReturn = pdFAIL;
		}
		if( ( allowIPVersion & eIPv6 ) == 0 && pxEndPoint->bits.bIPv6 )
		{
			xReturn = pdFAIL;
		}
	}
	#endif	/* ipconfigUSE_IPv6 */
	if( xReturn )
	{
	#if( ipconfigMULTI_INTERFACE != 0 ) && ( ipconfigUSE_IPv6 != 0 )
		FreeRTOS_printf( ( "LLMNR query '%s' = %d IPv%c\n", pcName, (int)xReturn, pxEndPoint->bits.bIPv6 ? '6' : '4' ) );
	#else
		FreeRTOS_printf( ( "LLMNR query '%s' = %d IPv4 only\n", pcName, (int)xReturn ) );
	#endif
	}

	return xReturn;
}
/*-----------------------------------------------------------*/

/* Called by FreeRTOS+TCP when the network connects or disconnects.  Disconnect
events are only received if implemented in the MAC driver. */
#if( ipconfigMULTI_INTERFACE != 0 )
	void vApplicationIPNetworkEventHook_Multi( eIPCallbackEvent_t eNetworkEvent, NetworkEndPoint_t *pxEndPoint )
#else
	void vApplicationIPNetworkEventHook( eIPCallbackEvent_t eNetworkEvent )
#endif
{
static BaseType_t xTasksAlreadyCreated = pdFALSE;

	/* If the network has just come up...*/
	if( eNetworkEvent == eNetworkUp )
	{
		/* Create the tasks that use the IP stack if they have not already been
		created. */
		if( xTasksAlreadyCreated == pdFALSE )
		{
			/* Tasks that use the TCP/IP stack can be created here. */

			/* Start a new task to fetch logging lines and send them out. */
			vUDPLoggingTaskCreate();

			#if( mainCREATE_TCP_ECHO_TASKS_SINGLE == 1 )
			{
				/* See http://www.freertos.org/FreeRTOS-Plus/FreeRTOS_Plus_TCP/TCP_Echo_Clients.html */
				vStartTCPEchoClientTasks_SingleTasks( configMINIMAL_STACK_SIZE * 4, tskIDLE_PRIORITY + 1 );
			}
			#endif

			#if( mainCREATE_SIMPLE_TCP_ECHO_SERVER == 1 )
			{
				/* See http://www.freertos.org/FreeRTOS-Plus/FreeRTOS_Plus_TCP/TCP_Echo_Server.html */
				vStartSimpleTCPServerTasks( configMINIMAL_STACK_SIZE * 4, tskIDLE_PRIORITY + 1 );
			}
			#endif

			#if( ( mainCREATE_FTP_SERVER == 1 ) || ( mainCREATE_HTTP_SERVER == 1 ) )
			{
				/* Let the server work task now it can now create the servers. */
				xTaskNotifyGive( xServerWorkTaskHandle );
			}
			#endif

			xTasksAlreadyCreated = pdTRUE;
			xStartServices = EStartupStart;
		}

		#if( ipconfigMULTI_INTERFACE == 0 )
		{
		uint32_t ulIPAddress, ulNetMask, ulGatewayAddress, ulDNSServerAddress;
		char pcBuffer[ 16 ];
			/* Print out the network configuration, which may have come from a DHCP
			server. */
			FreeRTOS_GetAddressConfiguration( &ulIPAddress, &ulNetMask, &ulGatewayAddress, &ulDNSServerAddress );
			FreeRTOS_inet_ntoa( ulIPAddress, pcBuffer );
			FreeRTOS_printf( ( "IP Address: %s\n", pcBuffer ) );

			FreeRTOS_inet_ntoa( ulNetMask, pcBuffer );
			FreeRTOS_printf( ( "Subnet Mask: %s\n", pcBuffer ) );

			FreeRTOS_inet_ntoa( ulGatewayAddress, pcBuffer );
			FreeRTOS_printf( ( "Gateway Address: %s\n", pcBuffer ) );

			FreeRTOS_inet_ntoa( ulDNSServerAddress, pcBuffer );
			FreeRTOS_printf( ( "DNS Server Address: %s\n", pcBuffer ) );
		}
		#else
		{
			/* Print out the network configuration, which may have come from a DHCP
                 Print out the network configuration, which may have come from a DHCP
                 * server. */
                showEndPoint( pxEndPoint );
		}
		#endif /* ipconfigMULTI_INTERFACE */
	}
}
/*-----------------------------------------------------------*/

EXTERN_C void vApplicationMallocFailedHook( void );
void vApplicationMallocFailedHook( void )
{
	/* Called if a call to pvPortMalloc() fails because there is insufficient
	free memory available in the FreeRTOS heap.  pvPortMalloc() is called
	internally by FreeRTOS API functions that create tasks, queues, software
	timers, and semaphores.  The size of the FreeRTOS heap is set by the
	configTOTAL_HEAP_SIZE configuration constant in FreeRTOSConfig.h. */

	/* Force an assert. */
	configASSERT( ( volatile void * ) NULL );
}
/*-----------------------------------------------------------*/

void vApplicationStackOverflowHook( TaskHandle_t pxTask, char *pcTaskName )
{
	( void ) pcTaskName;
	( void ) pxTask;

	/* Run time stack overflow checking is performed if
	configCHECK_FOR_STACK_OVERFLOW is defined to 1 or 2.  This hook
	function is called if a stack overflow is detected. */

	/* Force an assert. */
	configASSERT( ( volatile void * ) NULL );
}
/*-----------------------------------------------------------*/

