htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
		return 0;
	}
	/*-----------------------------------------------------------*/

	#if GNUC_NEED_SBRK
		EXTERN_C void *_sbrk( ptrdiff_t __incr);
		void *_sbrk( ptrdiff_t __incr)
		{
			unknown_calls++;
	
			return 0;
		}
		/*-----------------------------------------------------------*/
	#endif
#endif


void vApplicationTickHook( void )
{
}
/*-----------------------------------------------------------*/

EXTERN_C void _init();
void _init()
{
}


/*_HT_ Please consider keeping the function below called HAL_ETH_MspInit().
It will be called from "stm32f4xx_hal_eth.c".
It is defined there as weak only.
My board didn't work without the settings made below.
*/
/* This is a callback function. */
void HAL_ETH_MspInit( ETH_HandleTypeDef* heth )
{
    GPIO_InitTypeDef GPIO_InitStructure;
    if (heth->Instance == ETH) {

        /* Enable GPIOs clocks */
        __HAL_RCC_GPIOA_CLK_ENABLE();
        __HAL_RCC_GPIOC_CLK_ENABLE();
        __HAL_RCC_GPIOG_CLK_ENABLE();

        /** ETH GPIO Configuration
          RMII_REF_CLK ----------------------> PA1
          RMII_MDIO -------------------------> PA2
          RMII_MDC --------------------------> PC1
          RMII_MII_CRS_DV -------------------> PA7
          RMII_MII_RXD0 ---------------------> PC4
          RMII_MII_RXD1 ---------------------> PC5
          RMII_MII_RXER ---------------------> PG2
          RMII_MII_TX_EN --------------------> PG11
          RMII_MII_TXD0 ---------------------> PG13
          RMII_MII_TXD1 ---------------------> PG14
         */
        /* Configure PA1, PA2 and PA7 */

        GPIO_InitStructure.Speed = GPIO_SPEED_HIGH;
        GPIO_InitStructure.Mode = GPIO_MODE_AF_PP;
        GPIO_InitStructure.Pull = GPIO_NOPULL; 
        GPIO_InitStructure.Alternate = GPIO_AF11_ETH;
        GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_2 | GPIO_PIN_7;
        HAL_GPIO_Init(GPIOA, &GPIO_InitStructure);

        /* Configure PC1, PC4 and PC5 */
        GPIO_InitStructure.Pin = GPIO_PIN_1 | GPIO_PIN_4 | GPIO_PIN_5;
        HAL_GPIO_Init(GPIOC, &GPIO_InitStructure);

        /* Configure PG2, PG11, PG13 and PG14 */
        GPIO_InitStructure.Pin =  GPIO_PIN_2 | GPIO_PIN_11 | GPIO_PIN_13 | GPIO_PIN_14;
        HAL_GPIO_Init(GPIOG, &GPIO_InitStructure);

        /* Enable the Ethernet global Interrupt */
        HAL_NVIC_SetPriority(ETH_IRQn, 0x7, 0);
        HAL_NVIC_EnableIRQ(ETH_IRQn);
        
        /* Enable ETHERNET clock  */
        __HAL_RCC_ETH_CLK_ENABLE();
    }
}

#ifdef DEBUG
	#undef DEBUG
#endif

#define DEBUG(X)			lUDPLoggingPrintf X

#define tcpechoPORT_NUMBER	7

Socket_t xListeningSocket = NULL;
Socket_t xChildSocket = NULL;

void tcpServerStart()
{
	BaseType_t xReceiveTimeOut = 10;
	struct freertos_sockaddr xBindAddress;
#if( ipconfigUSE_TCP_WIN == 1 )
	WinProperties_t xWinProps;

	/* Fill in the buffer and window sizes that will be used by the socket. */
	xWinProps.lTxBufSize = 2920;
	xWinProps.lTxWinSize = 2;
	xWinProps.lRxBufSize = 2920;
	xWinProps.lRxWinSize = 2;
#endif /* ipconfigUSE_TCP_WIN */

	if (xListeningSocket != NULL) {
		FreeRTOS_printf( ( "Socket already created\n" ) );
		return;
	}
	xListeningSocket = FreeRTOS_socket( FREERTOS_AF_INET, FREERTOS_SOCK_STREAM, FREERTOS_IPPROTO_TCP );
	configASSERT( xListeningSocket != FREERTOS_INVALID_SOCKET );

	/* Set a time out so accept() will just wait for a connection. */
	FreeRTOS_setsockopt( xListeningSocket, 0, FREERTOS_SO_RCVTIMEO, &xReceiveTimeOut, sizeof( xReceiveTimeOut ) );

	/* Set the window and buffer sizes. */
	#if( ipconfigUSE_TCP_WIN == 1 )
	{
		FreeRTOS_setsockopt( xListeningSocket, 0, FREERTOS_SO_WIN_PROPERTIES, ( void * ) &xWinProps, sizeof( xWinProps ) );
	}
	#endif /* ipconfigUSE_TCP_WIN */

	FreeRTOS_setsockopt( xListeningSocket, 0, FREERTOS_SO_SET_SEMAPHORE, ( void * ) &xServerSemaphore, sizeof( xServerSemaphore ) );

	/* Bind the socket to the port that the client task will send to, then
	listen for incoming connections. */
	xBindAddress.sin_port = FreeRTOS_htons( tcpechoPORT_NUMBER );
	FreeRTOS_bind( xListeningSocket, &xBindAddress, sizeof( xBindAddress ) );
	FreeRTOS_listen( xListeningSocket, 2 );
	FreeRTOS_printf( ( "Socket now created\n" ) );
}

void tcpServerWork()
{
	struct freertos_sockaddr xClient;
	socklen_t xSize = sizeof(xClient);
	if( xChildSocket != NULL ) {
		unsigned char pucRxBuffer[ 1400 ];
		BaseType_t lBytes = FreeRTOS_recv( xChildSocket, pucRxBuffer, ipconfigTCP_MSS, 0 );

		/* If data was received, echo it back. */
		if( lBytes >= 0 )
		{
			BaseType_t lSent = FreeRTOS_send( xChildSocket, pucRxBuffer, lBytes, 0 );

			if( ( lSent < 0 ) && ( lSent != pdFREERTOS_ERRNO_EAGAIN ) )
			{
				/* Socket closed? */
				FreeRTOS_closesocket( xChildSocket );
				xChildSocket = NULL;
			}
		}
		else if( lBytes < 0 && lBytes != -pdFREERTOS_ERRNO_EAGAIN )
		{
			/* Socket closed? */
			FreeRTOS_closesocket( xChildSocket );
			xChildSocket = NULL;
			FreeRTOS_printf( ( "Connection closed\n" ) );
		}
	} else if( xListeningSocket != NULL ) {
		xChildSocket = FreeRTOS_accept( xListeningSocket, &xClient, &xSize );
		if( xChildSocket != FREERTOS_INVALID_SOCKET && xChildSocket != NULL )
		{
			FreeRTOS_printf( ( "A new client comes in\n" ) );
		}
		else
		{
			xChildSocket = NULL;
		}
	}
}

#if( USE_PLUS_FAT != 0 )
static void prvFTPTask (void *pvParameters )
{
	for (;; )
	{
		if( ( pxSDDisk != NULL ) || ( pxRAMDisk != NULL ) )
		{
			#if( ipconfigUSE_HTTP != 0 ) || ( ipconfigUSE_FTP != 0 )
			{
				const TickType_t xInitialBlockTime = pdMS_TO_TICKS( 100U );
				FreeRTOS_TCPServerWork( pxTCPServer, xInitialBlockTime );
			}
			#endif
		}
		else
		{
			vTaskDelay (10);
		}
	}
}
#endif

uint32_t ulApplicationGetNextSequenceNumber(
    uint32_t ulSourceAddress,
    uint16_t usSourcePort,
    uint32_t ulDestinationAddress,
    uint16_t usDestinationPort )
{
	uint32_t ulReturn;
	xApplicationGetRandomNumber( &( ulReturn ) );
	return ulReturn;
}

EXTERN_C void xPortSysTickHandler( void );
EXTERN_C void SysTick_Handler(void);
void SysTick_Handler(void)
{
	/* USER CODE BEGIN SysTick_IRQn 0 */

	/* USER CODE END SysTick_IRQn 0 */
	if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED) {
		xPortSysTickHandler( );
	}
	HAL_IncTick();
	/* USER CODE BEGIN SysTick_IRQn 1 */

