htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
	/* USER CODE END SysTick_IRQn 1 */
}

//EXTERN_C void NMI_Handler( void )                   { for( ;; ) { __NOP(); } }
//EXTERN_C void HardFault_Handler( void )             { for( ;; ) { __NOP(); } }
//EXTERN_C void MemManage_Handler( void )             { for( ;; ) { __NOP(); } }
//EXTERN_C void BusFault_Handler( void )              { for( ;; ) { __NOP(); } }
//EXTERN_C void UsageFault_Handler( void )            { for( ;; ) { __NOP(); } }
//EXTERN_C void SVC_Handler( void )                   { for( ;; ) { __NOP(); } }
//EXTERN_C void DebugMon_Handler( void )              { for( ;; ) { __NOP(); } }
//EXTERN_C void PendSV_Handler( void )                { for( ;; ) { __NOP(); } }
//EXTERN_C void SysTick_Handler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void WWDG_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void PVD_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void TAMP_STAMP_IRQHandler( void )         { for( ;; ) { __NOP(); } }
EXTERN_C void RTC_WKUP_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void FLASH_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void RCC_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void EXTI0_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void EXTI1_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void EXTI2_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void EXTI3_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void EXTI4_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream0_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream1_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream2_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream3_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream4_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream5_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream6_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void ADC_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void CAN1_TX_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void CAN1_RX0_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void CAN1_RX1_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void CAN1_SCE_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void EXTI9_5_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void TIM1_BRK_TIM9_IRQHandler( void )      { for( ;; ) { __NOP(); } }
EXTERN_C void TIM1_UP_TIM10_IRQHandler( void )      { for( ;; ) { __NOP(); } }
EXTERN_C void TIM1_TRG_COM_TIM11_IRQHandler( void ) { for( ;; ) { __NOP(); } }
EXTERN_C void TIM1_CC_IRQHandler( void )            { for( ;; ) { __NOP(); } }
//EXTERN_C void TIM2_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void TIM3_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void TIM4_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void I2C1_EV_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void I2C1_ER_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void I2C2_EV_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void I2C2_ER_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void SPI1_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void SPI2_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void USART1_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void USART2_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void USART3_IRQHandler( void )             { for( ;; ) { __NOP(); } }
//EXTERN_C void EXTI15_10_IRQHandler( void )          { for( ;; ) { __NOP(); } }
EXTERN_C void RTC_Alarm_IRQHandler( void )          { for( ;; ) { __NOP(); } }
EXTERN_C void OTG_FS_WKUP_IRQHandler( void )        { for( ;; ) { __NOP(); } }
EXTERN_C void TIM8_BRK_TIM12_IRQHandler( void )     { for( ;; ) { __NOP(); } }
EXTERN_C void TIM8_UP_TIM13_IRQHandler( void )      { for( ;; ) { __NOP(); } }
EXTERN_C void TIM8_TRG_COM_TIM14_IRQHandler( void ) { for( ;; ) { __NOP(); } }
EXTERN_C void TIM8_CC_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void DMA1_Stream7_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void FMC_IRQHandler( void )                { for( ;; ) { __NOP(); } }
//EXTERN_C void SDMMC1_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void TIM5_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void SPI3_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void UART4_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void UART5_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void TIM6_DAC_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void TIM7_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void DMA2_Stream0_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA2_Stream1_IRQHandler( void )       { for( ;; ) { __NOP(); } }
EXTERN_C void DMA2_Stream2_IRQHandler( void )       { for( ;; ) { __NOP(); } }
//EXTERN_C void DMA2_Stream3_IRQHandler( void )       { for( ;; ) { __NOP(); } }
#if( HAS_AUDIO == 0 )
	EXTERN_C void DMA2_Stream4_IRQHandler( void )       { for( ;; ) { __NOP(); } }
#endif
//EXTERN_C void DMA2_Stream4_IRQHandler( void )       { for( ;; ) { __NOP(); } }
//EXTERN_C void ETH_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void ETH_WKUP_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void CAN2_TX_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void CAN2_RX0_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void CAN2_RX1_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void CAN2_SCE_IRQHandler( void )           { for( ;; ) { __NOP(); } }
EXTERN_C void OTG_FS_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void DMA2_Stream5_IRQHandler( void )       { for( ;; ) { __NOP(); } }
//EXTERN_C void DMA2_Stream6_IRQHandler( void )       { for( ;; ) { __NOP(); } }
#if( HAS_AUDIO == 0 )
	EXTERN_C void DMA2_Stream7_IRQHandler( void )       { for( ;; ) { __NOP(); } }
#endif
EXTERN_C void USART6_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void I2C3_EV_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void I2C3_ER_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void OTG_HS_EP1_OUT_IRQHandler( void )     { for( ;; ) { __NOP(); } }
EXTERN_C void OTG_HS_EP1_IN_IRQHandler( void )      { for( ;; ) { __NOP(); } }
EXTERN_C void OTG_HS_WKUP_IRQHandler( void )        { for( ;; ) { __NOP(); } }
EXTERN_C void OTG_HS_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void DCMI_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void RNG_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void FPU_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void UART7_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void UART8_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void SPI4_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void SPI5_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void SPI6_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void SAI1_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void LTDC_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void LTDC_ER_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void DMA2D_IRQHandler( void )              { for( ;; ) { __NOP(); } }
EXTERN_C void SAI2_IRQHandler( void )               { for( ;; ) { __NOP(); } }
EXTERN_C void QUADSPI_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void LPTIM1_IRQHandler( void )             { for( ;; ) { __NOP(); } }
EXTERN_C void CEC_IRQHandler( void )                { for( ;; ) { __NOP(); } }
EXTERN_C void I2C4_EV_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void I2C4_ER_IRQHandler( void )            { for( ;; ) { __NOP(); } }
EXTERN_C void SPDIF_RX_IRQHandler( void )           { for( ;; ) { __NOP(); } }

EXTERN_C void vListInsertGeneric( List_t * const pxList,
								ListItem_t * const pxNewListItem,
								MiniListItem_t * const pxWhere );
__attribute__((weak)) void vListInsertGeneric( List_t * const pxList,
								ListItem_t * const pxNewListItem,
								MiniListItem_t * const pxWhere )
{
	/* Insert a new list item into pxList, it does not sort the list,
	 * but it puts the item just before xListEnd, so it will be the last item
	 * returned by listGET_HEAD_ENTRY() */
	pxNewListItem->pxNext = ( struct xLIST_ITEM * configLIST_VOLATILE ) pxWhere;
	pxNewListItem->pxPrevious = pxWhere->pxPrevious;
	pxWhere->pxPrevious->pxNext = pxNewListItem;
	pxWhere->pxPrevious = pxNewListItem;

	/* Remember which list the item is in. */
	listLIST_ITEM_CONTAINER( pxNewListItem ) = ( struct xLIST * configLIST_VOLATILE ) pxList;

	( pxList->uxNumberOfItems )++;
}

void Set_LED_Number( BaseType_t xNumber, BaseType_t xValue )
{
}

