htibosch/freertos_plus_projects/plus/stm32F7/Src/main.c
int	vfprintf_r (struct _reent *apReent, FILE *apFile, const char *apFmt, va_list args)
{
	(void)apReent;
	(void)apFile;
	(void)apFmt;
	(void)args;
	return 0;
}

int	fclose_r (struct _reent *apReent, FILE *apFile)
{
	(void)apReent;
	(void)apFile;
	return 0;
}

_ssize_t _write_r (struct _reent *apReent, int aHandle, const void *ap, size_t aSize)
{
	(void)apReent;
	(void)aHandle;
	(void)ap;
	(void)aSize;
	return 0;
}

int _close_r (struct _reent *apReent, int aHandle)
{
	(void)apReent;
	(void)aHandle;
	return 0;
}

_ssize_t _read_r (struct _reent *apReent, int aHandle, void *apPtr, size_t aSize)
{
	(void)apReent;
	(void)aHandle;
	(void)apPtr;
	(void)aSize;
	return 0;
}

_off_t _lseek_r (struct _reent *apReent, int aHandle, _off_t aOffset, int aWhence)
{
	(void)apReent;
	(void)aHandle;
	(void)aOffset;
	(void)aWhence;
	return 0;
}

int	fclose (FILE *apFile)
{
	(void)apFile;
	configASSERT( 0 );
	return 0;
}

int	_fclose_r (struct _reent *apReent, FILE *apFile)
{
	(void)apReent;
	(void)apFile;
	configASSERT( 0 );
	return 0;
}

void exit(int status)
{
	configASSERT( 0 );
	( void ) status;
	for( ;; )
	{
	}
}

void __libc_fini_array (void)
{
}

#include <sys/stat.h>

int _stat(const char fname, struct stat *pstat)
{
	( void ) pstat;
	configASSERT( 0 );
	return 0;
}

int _fstat_r(struct _reent *ptr, int fd, struct stat *pstat)
{
	( void ) ptr;
	( void ) fd;
	( void ) pstat;
	configASSERT( 0 );
	return 0;
}

int _isatty_r(struct _reent *ptr, int fd)
{
	configASSERT( 0 );
	return 0;
}

#include "E:\Home\amazon-freertos\ipv6\amazon-freertos\libraries\freertos_plus\standard\freertos_plus_tcp\tools\tcp_utilities\tcp_dump_packets.c"

extern time_t time ( time_t *puxTime );
time_t time ( time_t *puxTime )
{
	time_t rc = FreeRTOS_time( puxTime );
	return rc;
}

void sdcard_test(void);
void sdcard_test(void)
{
}

void handle_user_test( char * pcBuffer )
{
    ( void ) pcBuffer;
    FreeRTOS_printf( ( "handle_user_test: called\n" ) );
}

void show_single_addressinfo( const char * pcFormat,
							  const struct freertos_addrinfo * pxAddress )
{
	char cBuffer[ 40 ];
	const uint8_t * pucAddress;

	#if ( ipconfigUSE_IPv6 != 0 )
		if( pxAddress->ai_family == FREERTOS_AF_INET6 )
		{
			pucAddress = pxAddress->ai_addr->sin_address.xIP_IPv6.ucBytes;
		}
		else
	#endif /* ( ipconfigUSE_IPv6 != 0 ) */
	{
		pucAddress = ( const uint8_t * ) &( pxAddress->ai_addr->sin_address );
	}

	( void ) FreeRTOS_inet_ntop( pxAddress->ai_family, ( const void * ) pucAddress, cBuffer, sizeof( cBuffer ) );

	if( pcFormat != NULL )
	{
		FreeRTOS_printf( ( pcFormat, cBuffer ) );
	}
	else
	{
		FreeRTOS_printf( ( "Address: %s\n", cBuffer ) );
	}
}
/*-----------------------------------------------------------*/

/**
 * @brief For testing purposes: print a list of DNS replies.
 * @param[in] pxAddress: The first reply received ( or NULL )
 */
void show_addressinfo( const struct freertos_addrinfo * pxAddress )
{
	const struct freertos_addrinfo * ptr = pxAddress;
	BaseType_t xIndex = 0;

	while( ptr != NULL )
	{
		show_single_addressinfo( "Found Address: %s", ptr );

		ptr = ptr->ai_next;
	}

	/* In case the function 'FreeRTOS_printf()` is not implemented. */
	( void ) xIndex;
}

void HAL_SD_MspInit( SD_HandleTypeDef * hsd )
{
    ( void ) hsd;
    /* NOTE : This function Should not be modified, when the callback is needed,
     *        the HAL_SD_MspInit could be implemented in the user file
     */
}

#if ( ipconfigMULTI_INTERFACE == 0 )
	extern BaseType_t xNTPHasTime;
	extern uint32_t ulNTPTime;

	struct
	{
		uint32_t ntpTime;
	}
	time_guard;

	int set_time( time_t * pxTime )
	{
		( void ) pxTime;
		time_guard.ntpTime = ulNTPTime - xTaskGetTickCount() / configTICK_RATE_HZ;
		return 0;
	}

	time_t get_time( time_t * puxTime )
	{
		if( xNTPHasTime != pdFALSE )
		{
			TickType_t passed = xTaskGetTickCount() / configTICK_RATE_HZ;

			*( puxTime ) = time_guard.ntpTime + passed;
		}
		else
		{
			*( puxTime ) = 0U;
		}

		return 1;
	}
#endif
